aaronderek0401-ops/ink-coop/components/grbl_esp32s3/Grbl_Esp32/src/WebUI/WebServer.cpp

/*
  WebServer.cpp -  web server functions class

  Copyright (c) 2014 Luc Lebosse. All rights reserved.

  This library is free software; you can redistribute it and/or
  modify it under the terms of the GNU Lesser General Public
  License as published by the Free Software Foundation; either
  version 2.1 of the License, or (at your option) any later version.

  This library is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
  Lesser General Public License for more details.

  You should have received a copy of the GNU Lesser General Public
  License along with this library; if not, write to the Free Software
  Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA
*/

#include "../Grbl.h"

#if defined(ENABLE_WIFI) && defined(ENABLE_HTTP)

#    include "WifiServices.h"

#    include "ESPResponse.h"
#    include "Serial2Socket.h"
#    include "WebServer.h"
#    include <WebSocketsServer.h>
#    include <WiFi.h>
#    include <FS.h>
#    include <SPIFFS.h>
#    ifdef ENABLE_SD_CARD
#        include <SD.h>
#        include "../SDCard.h"
#include "dirent.h"
#    endif
#    include <WebServer.h>
#    include <ESP32SSDP.h>
#    include <StreamString.h>
#    include <Update.h>
#    include <esp_wifi_types.h>
#    ifdef ENABLE_MDNS
#        include <ESPmDNS.h>
#    endif
#    ifdef ENABLE_SSDP
#        include <ESP32SSDP.h>
#    endif
#    ifdef ENABLE_CAPTIVE_PORTAL
#        include <DNSServer.h>

namespace WebUI {
    const byte DNS_PORT = 53;
    DNSServer  dnsServer;
}

#    endif
#    include <esp_ota_ops.h>

//embedded response file if no files on SPIFFS
#    include "NoFile.h"

static const char* TAG = "WebServer.cpp";

//namespace WebUI {
    //Default 404
   static const char PAGE_404[] =
        "<HTML>\n<HEAD>\n<title>Redirecting...</title> \n</HEAD>\n<BODY>\n<CENTER>Unknown page : $QUERY$- you will be "
        "redirected...\n<BR><BR>\nif not redirected, <a href='http://$WEB_ADDRESS$'>click here</a>\n<BR><BR>\n<PROGRESS name='prg' "
        "id='prg'></PROGRESS>\n\n<script>\nvar i = 0; \nvar x = document.getElementById(\"prg\"); \nx.max=5; \nvar "
        "interval=setInterval(function(){\ni=i+1; \nvar x = document.getElementById(\"prg\"); \nx.value=i; \nif (i>5) "
        "\n{\nclearInterval(interval);\nwindow.location.href='/';\n}\n},1000);\n</script>\n</CENTER>\n</BODY>\n</HTML>\n\n";
   static const char PAGE_CAPTIVE[] =
        "<HTML>\n<HEAD>\n<title>Captive Portal</title> \n</HEAD>\n<BODY>\n<CENTER>Captive Portal page : $QUERY$- you will be "
        "redirected...\n<BR><BR>\nif not redirected, <a href='http://$WEB_ADDRESS$'>click here</a>\n<BR><BR>\n<PROGRESS name='prg' "
        "id='prg'></PROGRESS>\n\n<script>\nvar i = 0; \nvar x = document.getElementById(\"prg\"); \nx.max=5; \nvar "
        "interval=setInterval(function(){\ni=i+1; \nvar x = document.getElementById(\"prg\"); \nx.value=i; \nif (i>5) "
        "\n{\nclearInterval(interval);\nwindow.location.href='/';\n}\n},1000);\n</script>\n</CENTER>\n</BODY>\n</HTML>\n\n";

    bool process_command(const char* cmd) {
        char scmd[64]; 
        int cmd_len = strlen(cmd);
        int start_index = 0;
        bool silent = false;
        bool hasError = false;
        
        for (int i = 0; i <= cmd_len; i++) {
            if (cmd[i] == '\n' || cmd[i] == '\0') {
                int scmd_len = i - start_index;
                strncpy(scmd, &cmd[start_index], scmd_len);
                scmd[scmd_len] = '\0';  // Null terminate the string

                if (!silent && scmd_len == 2 && scmd[0] == 0xC2) {
                    scmd[0] = scmd[1];
                    scmd[1] = '\0';
                }

                if (scmd_len > 1) {
                    strcat(scmd, "\n");
                } else if (is_realtime_command(scmd[0])) {
                    ESP_LOGW(TAG, "[realtime command]Receive: %s", scmd);
                    execute_realtime_command((Cmd)scmd[0], CLIENT_WEBUI);
                    start_index = i + 1;
                    hasError = true;
                    continue;
                } else {
                    strcat(scmd, "\n");
                }

                ESP_LOGW(TAG, "Receive to Serial2Socket: %s", scmd);
                ESP_LOG_BUFFER_HEX(TAG, scmd, strlen(scmd));

                if (!WebUI::Serial2Socket.push(scmd)) {
                    hasError = true;
                }

                start_index = i + 1;
            }
        }
        return hasError;
    }

    void url_decode(char* str) {
        char *pstr = str;
        char hex[3] = {0}; 
        while (*pstr) {
            if (*pstr == '%' && *(pstr + 1) && *(pstr + 2)) {
                hex[0] = *(pstr + 1);
                hex[1] = *(pstr + 2);
                *pstr = (char)strtol(hex, NULL, 16);  
                memmove(pstr + 1, pstr + 3, strlen(pstr + 3) + 1); 
            } else if (*pstr == '+') {
                *pstr = ' ';
                pstr++;
            } else {
                pstr++;
            }
        }
    }

    void replace_double_slashes(char *str) {
        char *read_ptr = str;  
        char *write_ptr = str; 
        
        while (*read_ptr != '\0') {
            if (*read_ptr == '/' && *(read_ptr + 1) == '/') {
                
                *write_ptr = *read_ptr;  
                write_ptr++;            
                read_ptr++;              
            } else {
                
                *write_ptr = *read_ptr;
                write_ptr++; 
            }
            read_ptr++;     
        }
        
        *write_ptr = '\0';
    }
Error delete_files(const char *path) {
    // Check if file exists
    struct stat st;
    ESP_LOGE(TAG, "delete_files: %d", sizeof(struct stat));
    if (stat(path, &st) == 0) {
        //ESP_LOGI(TAG, "File %s exists", path);
        //return ESP_OK;
    } else {
        ESP_LOGE(TAG, "File %s does not exist", path);
        return Error::FsFileNotFound;
    }

    if (S_ISDIR(st.st_mode)) {
        DIR *dir = opendir(path);
        if (!dir) {
            ESP_LOGE(TAG, "Failed to open directory: %s", path);
            return Error::FsFailedOpenFile;
        }

        struct dirent *entry;
        while ((entry = readdir(dir)) != NULL) {
            if (strcmp(entry->d_name, ".") == 0 || strcmp(entry->d_name, "..") == 0) {
                continue;
            }

            size_t path_len = strlen(path) + strlen(entry->d_name) + 2;
            char *entryPath = (char *)malloc(path_len);
            if (entryPath == NULL) {
                ESP_LOGE(TAG, "Memory allocation failed for entryPath");
                closedir(dir);
                return Error::FsFailedDelFile;
            }
            snprintf(entryPath, path_len, "%s/%s", path, entry->d_name);

            if (delete_files(entryPath) != Error::Ok) {
                free(entryPath);
                closedir(dir);
                return Error::FsFailedDelFile;
            }

            free(entryPath);
        }
        closedir(dir);

        if (rmdir(path) != 0) {
            return Error::FsFailedDelDir;
        }
    } else {
        if (SD.remove(path)) {
            ESP_LOGE(TAG, "Failed to delete file: %s", path);
            return Error::FsFailedDelFile;
        }
    }
    return Error::Ok;
}
    static esp_err_t update_upload_handler(httpd_req_t *req) {
        #define UPDATE_UPLOAD_BUFFER_SIZE 2048
        esp_ota_handle_t update_handle = 0;
        const esp_partition_t *update_partition = NULL;
        char*  buf = (char *)calloc(1, UPDATE_UPLOAD_BUFFER_SIZE);
        if (!buf) {
            ESP_LOGE(TAG, "Failed to allocate memory of %d bytes!", req->content_len);
            httpd_resp_send_500(req);
            return ESP_ERR_NO_MEM;
        }
        int received;
        int remaining = req->content_len;

        int total_received = 0;
        int last_percent = -1;
        int current_percent = 0;

