aaronderek0401-ops/ink-coop/components/grbl_esp32s3/Grbl_Esp32/src/WebUI/WebServer.cpp
        if ((received = httpd_req_recv(req, buf, MIN(remaining, UPDATE_UPLOAD_BUFFER_SIZE))) <= 0) {
            free(buf);
            /* Respond with 500 Internal Server Error */
            httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Failed to receive file");
            return ESP_FAIL;
        }
        UpdateFirmwareFileInfo updateFileInfo;
        const char *currentPos = buf;
        const char *str = "Content-Disposition: form-data; name=";
        uint8_t strLen = strlen(str);
        uint64_t start_time = esp_timer_get_time();
        if ((currentPos = strcasestr(currentPos, str)) != NULL) {
            currentPos += strLen;
            char temp[32];
            if (sscanf(currentPos,"\"%[^\"]\"\r\n\r\n%[^\r\n]", temp,updateFileInfo.path) == 2) {
                if (strcmp(temp, "path") != 0) {
                    free(buf);
                    ESP_LOGE(TAG, "Invalid Content-Disposition header");
                    httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Invalid parameter");
                    return ESP_ERR_INVALID_ARG;
                }
            } else {
                free(buf);
                grbl_send(CLIENT_ALL, "[MSG:Invalid parameter]\r\n");
                ESP_LOGE(TAG, "Failed to parse Content-Disposition header");
                httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Invalid parameter");
                return ESP_ERR_INVALID_ARG;
            }
        } else {
            free(buf);
            httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Invalid parameter");
            return ESP_ERR_INVALID_ARG;
        }
        if ((currentPos = strcasestr(currentPos, str)) != NULL) {
            currentPos += strLen;
            char temp[32];
            if (sscanf(currentPos, "\"%[^\"]\"\r\n\r\n%u", temp,&updateFileInfo.totalSize) == 2) {
                if (strcmp(temp, "firmware.binS") != 0) {
                    free(buf);
                    ESP_LOGE(TAG, "Invalid Content-Disposition header");
                    httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Invalid parameter");
                    return ESP_ERR_INVALID_ARG;
                }
            } else {
                free(buf);
                grbl_send(CLIENT_ALL, "[MSG:Invalid parameter]\r\n");
                ESP_LOGE(TAG, "Failed to parse Content-Disposition header");
                httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Invalid parameter");
                return ESP_ERR_INVALID_ARG;
            }
        } else {
            free(buf);
            httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Invalid parameter");
            return ESP_ERR_INVALID_ARG;
        }
        if ((currentPos = strcasestr(currentPos, str)) != NULL) {
            currentPos += strLen;
            char temp[32];
            if (sscanf(currentPos, "\"%[^\"]\"; filename=\"%[^\"]\"", temp, updateFileInfo.name) == 2) {
                if (strcmp(temp, "file") != 0) {
                    free(buf);
                    ESP_LOGE(TAG, "Invalid Content-Disposition header");
                    httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Invalid parameter");
                    return ESP_ERR_INVALID_ARG;
                }
                if ((currentPos = strcasestr(currentPos, "\r\n\r\n")) != NULL) {
                    currentPos += strlen("\r\n\r\n");
                    if (OTA_update_init(&update_handle, &update_partition) != ESP_OK)
                     {
                        free(buf);
                        grbl_send(CLIENT_ALL, "[MSG:Upload cancelled]\r\n");
                        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "OTA init failed");
                        return ESP_ERR_INVALID_ARG;
                    }

                    if (updateFileInfo.totalSize >= update_partition->size) {
                        free(buf);
                        grbl_send(CLIENT_ALL, "[MSG:Upload rejected, not enough space]\r\n");
                        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Upload rejected, not enough space");
                        return ESP_ERR_INVALID_SIZE;
                    }
                     int first_chunk_size = received - (currentPos - buf);
                    if (esp_ota_write(update_handle, (const void *)currentPos, received - (currentPos - buf)) != ESP_OK) {
                        free(buf);
                        OTA_update_end(update_handle, update_partition);
                        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "File write failed");
                        return ESP_FAIL;
                    }
                    total_received += first_chunk_size;
                    current_percent = (total_received * 100) / updateFileInfo.totalSize;
                    if (current_percent != last_percent) {
                        grbl_sendf(CLIENT_ALL, "[MSG:Upload progress: %d%%]\r\n", current_percent);
                        last_percent = current_percent;
                    }
                }
            } else {
                free(buf);
                grbl_send(CLIENT_ALL, "[MSG:Invalid parameter]\r\n");
                httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Invalid parameter");
                return ESP_ERR_INVALID_ARG;
            }
        } else {
            free(buf);
            grbl_send(CLIENT_ALL, "[MSG:Invalid parameter]\r\n");
            httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Invalid parameter");
            return ESP_ERR_INVALID_ARG;
        }
        remaining -= received;
        while (remaining > 0) {
            if ((received = httpd_req_recv(req, buf, MIN(remaining, UPDATE_UPLOAD_BUFFER_SIZE))) <= 0) {
                if (received == HTTPD_SOCK_ERR_TIMEOUT) {
                    continue;
                }
                free(buf);
                OTA_update_end(update_handle, update_partition);
                httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Failed to receive file");
                return ESP_FAIL;
            }

