aaronderek0401-ops/ink-coop/components/grbl_esp32s3/Grbl_Esp32/src/WebUI/WebServer.cpp
            if (esp_ota_write(update_handle, (const void *)buf, received) != ESP_OK) {
                free(buf);
                OTA_update_end(update_handle, update_partition);
                httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "File write failed");
                return ESP_FAIL;
            }
            remaining -= received;
            total_received += received;
            current_percent = (total_received * 100) / updateFileInfo.totalSize;
         //   if (current_percent != last_percent && (current_percent % 5 == 0 || current_percent == 100)) {
                grbl_sendf(CLIENT_ALL, "[MSG:Upload progress: %d%%]\r\n", current_percent);
                last_percent = current_percent;
          //  }
        }
        free(buf);
        OTA_update_end(update_handle, update_partition);
        grbl_send(CLIENT_ALL, "Firmware update successful!");
        httpd_resp_send(req, "Upload end, wait reboot", HTTPD_RESP_USE_STRLEN);
        WebUI::COMMANDS::wait(1000);
        WebUI::COMMANDS::restart_ESP();
        return ESP_OK;
    }
    static esp_err_t web_command_handler(httpd_req_t *req) {
        WebUI::AuthenticationLevel auth_level = WebUI::AuthenticationLevel::LEVEL_ADMIN;
        char command_str[255];
        uint64_t start_time = esp_timer_get_time();
        httpd_resp_set_hdr(req, "Connection", "close");
        size_t len = httpd_req_get_url_query_len(req);
        if (len == 0) {
            httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Invalid command");
            return ESP_ERR_INVALID_ARG;
        }
        
        char *parametr = (char *)malloc(len + 1);
        if (parametr == NULL) {
            httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "No memory");
            return ESP_ERR_NO_MEM;
        }
        if (httpd_req_get_url_query_str(req, parametr, len + 1) == ESP_OK) {
            url_decode(parametr);

            if (httpd_query_key_value(parametr, "plain", command_str, sizeof(command_str)) == ESP_OK) {
            } else if (httpd_query_key_value(parametr, "commandText", command_str, sizeof(command_str)) == ESP_OK) {
            } else {
                free(parametr);
                const char *err = "Invalid command";
                httpd_resp_send(req, err, strlen(err));
                return ESP_ERR_INVALID_ARG;
            }
        } else {
            free(parametr);
            const char *err = "Invalid command";
            httpd_resp_send(req, err, strlen(err));
            return ESP_ERR_INVALID_ARG;
        }
        if (strcasestr(command_str, "[ESP") != NULL) {
            char line[256];
            strncpy(line, command_str, 255);
            WebUI::ESPResponseStream* espresponse = new WebUI::ESPResponseStream(CLIENT_WEBUI, req);
            if (espresponse == NULL) {
                httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "No memory");
                free(parametr);
                return ESP_ERR_NO_MEM;
            }

            Error              err         = system_execute_line(line, espresponse, auth_level);
            String             answer;
            if (err == Error::Ok) {
                answer = "ok";
            } else {
                const char* msg = errorString(err);
                answer          = "Error: ";
                if (msg) {
                    answer += msg;
                } else {
                    answer += static_cast<int>(err);
                }
            }
            if (!espresponse->anyOutput()) {
                httpd_resp_set_type(req, HTTPD_TYPE_TEXT);
                httpd_resp_send(req, answer.c_str(), HTTPD_RESP_USE_STRLEN);
            } else {
                espresponse->flush();
            }
            delete(espresponse);
        } else {
            ESP_LOG_BUFFER_HEX(TAG, command_str, strlen(command_str));
            bool hasError = process_command(command_str);

            httpd_resp_send(req, hasError? "Error": "", HTTPD_RESP_USE_STRLEN);
        }

        free(parametr);
        uint64_t end_time = esp_timer_get_time();
        return ESP_OK;
    }
    
    static esp_err_t root_handler(httpd_req_t *req)
    {
        // 使用未压缩的HTML文件
        extern const char web_layout_start[] asm("_binary_web_layout_html_start");
        extern const char web_layout_end[]   asm("_binary_web_layout_html_end");
        const size_t file_size = (web_layout_end - web_layout_start);
        
        ESP_LOGI("WEB", "web_layout.html size: %d bytes", file_size);
        
        if (file_size == 0) {
            ESP_LOGE("WEB", "web_layout.html not found or empty");
            // 返回一个简单的错误页面
            const char* error_html = 
                "<!DOCTYPE html><html><head><title>Error</title></head>"
                "<body><h1>Layout Editor Not Available</h1>"
                "<p>Please check if web_layout.html is properly embedded.</p></body></html>";
            httpd_resp_set_type(req, "text/html");
            httpd_resp_send(req, error_html, strlen(error_html));
            return ESP_OK;
        }
        
        httpd_resp_set_type(req, "text/html");
        httpd_resp_send(req, web_layout_start, file_size);
        return ESP_OK;
        //         extern const unsigned char file_start[] asm("_binary_index_html_gz_start");
        // extern const unsigned char file_end[]   asm("_binary_index_html_gz_end");
        // const size_t file_size = (file_end - file_start);

        // httpd_resp_set_hdr(req, "Content-Encoding", "gzip");

        // httpd_resp_send(req, (char *)file_start, file_size);
        // return ESP_OK;
    }
    static esp_err_t icon_handler(httpd_req_t *req)
    {
        extern const unsigned char icon_start[] asm("_binary_favicon_ico_start");
        extern const unsigned char icon_end[]   asm("_binary_favicon_ico_end");
        const size_t icon_size = (icon_end - icon_start);

        httpd_resp_set_hdr(req, "Content-Type", "image/x-icon");
        httpd_resp_send(req, (char *)icon_start, icon_size);
        return ESP_OK;
    }
    static esp_err_t not_found_handle(httpd_req_t *req, httpd_err_code_t error)
    {
        if (error == HTTPD_404_NOT_FOUND) {
            String contentType = PAGE_404;
            String KEY_IP    = "$WEB_ADDRESS$";
            String KEY_QUERY = "$QUERY$"; 
            String stmp = (WiFi.getMode() == WIFI_STA) ? WiFi.localIP().toString() : WiFi.softAPIP().toString();

