aaronderek0401-ops/ink-coop/components/grbl_esp32s3/Grbl_Esp32/src/WebUI/WebServer.cpp
            uint16_t port = WebUI::http_port->get();
            if (port != 80) {
                stmp += ":" + String(port);
            }
            
            contentType.replace(KEY_IP, stmp);
            contentType.replace(KEY_QUERY, req->uri);

            httpd_resp_set_hdr(req, "Content-Type", HTTPD_TYPE_TEXT);
            httpd_resp_send(req, contentType.c_str(), HTTPD_RESP_USE_STRLEN);
        }
        return ESP_OK;
    }
            //SD File upload with direct access to SD///////////////////////////////
    static esp_err_t SDFile_direct_upload_handler(httpd_req_t *req) {
        #define UPLOAD_FILE_BUFFER_SIZE 1024
        static File   sdUploadFile;
        if (req->method == HTTP_POST) {
            size_t free_heap_size = heap_caps_get_free_size(MALLOC_CAP_8BIT);
            //ESP_LOGI(TAG, "Free heap size: %d bytes", free_heap_size);
           char* buf = (char*)heap_caps_malloc(UPLOAD_FILE_BUFFER_SIZE, MALLOC_CAP_INTERNAL);
            if (!buf) {
                ESP_LOGE(TAG, "Failed to allocate memory of %d bytes!", req->content_len);
                httpd_resp_send_500(req);
                return ESP_ERR_NO_MEM;
            }

            int received=0, remaining = 0;
            size_t write_size = 0;

            int last_percent = -1;
            int current_percent = 0;
            int total_received = 0;

            //ESP_LOGI(TAG, "Upload file size : %d", remaining);
            String tempFileName;
            if ((received = httpd_req_recv(req, buf, MIN(req->content_len, UPLOAD_FILE_BUFFER_SIZE))) <= 0) {
                free(buf);
                /* Respond with 500 Internal Server Error */
                httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Failed to receive file");
                return ESP_FAIL;
            }
            UploadFileInfo uploadFileInfo;
            const char *currentPos = buf;
            const char *str = "content-disposition: form-data; name=";
            uint8_t strLen = strlen(str);
            uint64_t start_time = esp_timer_get_time();
            if ((currentPos = strcasestr(currentPos, str)) != NULL) {
                currentPos += strLen;
                char temp[32];
                if (sscanf(currentPos, "\"%[^\"]\"\r\n\r\n%[^\r\n]", temp, uploadFileInfo.path) == 2) {
                    if (strcmp(temp, "path") != 0) {
                        free(buf);
                        ESP_LOGE(TAG, "Invalid Content-Disposition header");
                        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Invalid parameter");
                        return ESP_ERR_INVALID_ARG;
                    }
                } else {
                    free(buf);
                    ESP_LOGE(TAG, "Failed to parse Content-Disposition header");
                    httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Invalid parameter");
                    return ESP_ERR_INVALID_ARG;
                }
            } else {
                free(buf);
                httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Invalid parameter");
                return ESP_ERR_INVALID_ARG;
            }

            if ((currentPos = strcasestr(currentPos, str)) != NULL) {
                currentPos += strLen;
                char temp[32];
                if (sscanf(currentPos, "\"%[^\"]\"\r\n\r\n%u",temp, &uploadFileInfo.totalSize) == 2) {
                    if (strcmp(temp, "size") != 0) {
                        free(buf);
                        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Invalid parameter");
                        return ESP_ERR_INVALID_ARG;
                    }
                } else {
                    free(buf);
                    httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Invalid parameter");
                    return ESP_ERR_INVALID_ARG;
                }
            } else {
                free(buf);
                httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Invalid parameter");
                return ESP_ERR_INVALID_ARG;
            } 
            if ((currentPos = strcasestr(currentPos, str)) != NULL) {
                currentPos += strLen;
                char temp[32];
                if (sscanf(currentPos, "\"%[^\"]\"; filename=\"%[^\"]\"", temp, uploadFileInfo.name) == 2) {
                    if (strcmp(temp, "file") != 0) {
                        free(buf);
                        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Invalid parameter");
                        return ESP_ERR_INVALID_ARG;
                    }
                    if ((currentPos = strcasestr(currentPos, "\r\n\r\n")) != NULL) {
                        currentPos += strlen("\r\n\r\n");
                        if (get_sd_state(true) != SDState::Idle) {
                            grbl_send(CLIENT_ALL, "[MSG:Upload cancelled]\r\n");
                            if (get_sd_state(true) == SDState::NotPresent) {
                                httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "No SD card");
                            } else {
                                httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "SDCard busy");
                            }
                            free(buf);
                            return ESP_ERR_INVALID_ARG;
                        }
                        set_sd_state(SDState::BusyUploading);
                        String filename = uploadFileInfo.name;
                        if (filename[0] != '/') {
                            filename = "/" + filename;
                        }
                        tempFileName = filename;
                        if (SD.exists(filename)) {
                            SD.remove(filename);
                            if (tempFileName.length() > 0 && tempFileName.startsWith("/")) {
                                tempFileName = tempFileName.substring(1);
                            }
                        }
                        String sizeargname =filename + "S";
                        if (uploadFileInfo.totalSize > 0) {
                            remaining = uploadFileInfo.totalSize;
                            uint64_t freespace = SD.totalBytes() - SD.usedBytes();
                            if (uploadFileInfo.totalSize > freespace) {
                                free(buf);
                                grbl_send(CLIENT_ALL, "[MSG:Upload error]\r\n");
                                set_sd_state(SDState::Idle);
                                httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Upload rejected, not enough space");
                                return ESP_ERR_INVALID_ARG;
                            }
                        }
                        //Create file for writing
                         size_t bytesWritten = 0;
                        sdUploadFile = SD.open(filename.c_str(), FILE_WRITE);
                        //check if creation succeed
                        if (!sdUploadFile) {
                            free(buf);
                            sdUploadFile.close();
                            grbl_send(CLIENT_ALL, "[MSG:Upload failed]\r\n");
                            set_sd_state(SDState::Idle);
                            httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "File creation failed");
                            return ESP_ERR_NO_MEM;
                        } else 
                        {
                            if (received - (currentPos - buf) > remaining) {
                                write_size = remaining;
                            } else {
                                write_size = received - (currentPos - buf);
                            }
                           bytesWritten=sdUploadFile.write((const uint8_t *)currentPos,write_size); 
                            if (write_size != bytesWritten) {
                                free(buf);
                                grbl_send(CLIENT_ALL, "[MSG:Upload error]\r\n");
                                sdUploadFile.close();
                                set_sd_state(SDState::Idle);
                                httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Upload error");
                            }
                            remaining -= bytesWritten;

