aaronderek0401-ops/ink-coop/components/grbl_esp32s3/Grbl_Esp32/src/WebUI/WebServer.cpp
                            total_received += bytesWritten;
                            current_percent = (total_received * 100) / uploadFileInfo.totalSize;
                            if (current_percent > last_percent) {
                                grbl_sendf(CLIENT_ALL, "[MSG:Progress: %d%%]\r\n", current_percent);
                                last_percent = current_percent;
                            }
                        }  
                    }
                } else {
                    free(buf);
                    httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Invalid parameter");
                    set_sd_state(SDState::Idle);
                    return ESP_ERR_INVALID_ARG;
                }
            } else {
                free(buf);
                httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Invalid parameter");
                set_sd_state(SDState::Idle);
                 return ESP_ERR_INVALID_ARG;
            }

            printf("path:%s, file:%s, size:%d", uploadFileInfo.path, uploadFileInfo.name, uploadFileInfo.totalSize);
           
            while (remaining > 0) {
                if ((received = httpd_req_recv(req, buf, MIN(remaining, UPLOAD_FILE_BUFFER_SIZE))) <= 0) {
                    if (received == HTTPD_SOCK_ERR_TIMEOUT) {
                        continue;
                    }
                    httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Failed to receive file");
                    sdUploadFile.close();
                    set_sd_state(SDState::Idle);
                    free(buf);
                    return ESP_FAIL;
                }
                size_t bytesWritten = 0;
                write_size = (received > remaining)? remaining: received;
                bytesWritten=sdUploadFile.write((const uint8_t *)buf, write_size);
                if (write_size != bytesWritten) {
                    grbl_send(CLIENT_ALL, "[MSG:SDCard write error]\r\n");
                    sdUploadFile.close();
                    set_sd_state(SDState::Idle);
                    free(buf);
                    httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "SDCard write error");
                     return ESP_FAIL;
                }
                remaining -= bytesWritten;

                total_received += bytesWritten;
                current_percent = (total_received * 100) / uploadFileInfo.totalSize;
               // if ((current_percent > last_percent && (current_percent % 5 == 0 || current_percent == 100)) ) { 
                    grbl_sendf(CLIENT_ALL, "[MSG:Progress: %d%%]\r\n", current_percent);
                    last_percent = current_percent;
               // }
            }  
            free(buf);
            sdUploadFile.close();  
            if (tempFileName.length() > 0 && tempFileName.startsWith("/")) {
                tempFileName = tempFileName.substring(1);
            }
            printf("upload success, use time:%lldus\n", esp_timer_get_time() - start_time);
            set_sd_state(SDState::Idle);  
        } 
        char command_str[64];   
        bool     list_files = true;
        uint64_t totalspace = 0;
        uint64_t freespace  = 0;
        uint64_t usedspace  = 0;

        String sstatus = "Ok";
        httpd_resp_set_hdr(req, "Connection", "close");
        char *path = (char *)heap_caps_calloc(1, 256, MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT);
        if (path == NULL) {
            httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "No memory");
            return ESP_ERR_NO_MEM;
        }
        *path = '/';
        size_t len = httpd_req_get_url_query_len(req);
        if (len == 0 && req->method != HTTP_POST) {
            const char *err = "Invalid command";
            httpd_resp_set_type(req, HTTPD_TYPE_TEXT);
            httpd_resp_send(req, err, strlen(err));
            return ESP_ERR_INVALID_ARG;
        }

        char *parametr = (char *)heap_caps_malloc(len + 1, MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT);
        if (parametr == NULL) {
            httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "No memory");
            return ESP_ERR_NO_MEM;
        } 
        SDState  state      = get_sd_state(true);
        if (state != SDState::Idle) {
            String status = "{\"status\":\"";
            status += state == SDState::NotPresent ? "No SD Card\"}" : "Busy\"}";
            httpd_resp_set_hdr(req, "Cache-Control", "no-cache");
            httpd_resp_set_type(req, "application/json");
            httpd_resp_send(req, status.c_str(), status.length());
            return ESP_OK;
        }
        set_sd_state(SDState::BusyParsing);
        if (httpd_req_get_url_query_str(req, parametr, len + 1) == ESP_OK) {
            url_decode(parametr);
            if (httpd_query_key_value(parametr, "path", command_str, sizeof(command_str)) == ESP_OK) {
                strcpy(path + 1, command_str);
                replace_double_slashes(path);
                if (path[strlen(path) - 1] != '/') {
                    strcat(path, "/");
                }
            }
            if (httpd_query_key_value(parametr, "action", command_str, sizeof(command_str)) == ESP_OK) {
                if (strcmp(command_str, "delete") == 0 ) {
                    if (httpd_query_key_value(parametr, "filename", command_str, sizeof(command_str)) == ESP_OK) {
                        String filename;
                        String shortname = command_str;
                        filename         = path + shortname;
                        shortname.replace("/", "");
                        filename.replace("//", "/");
                        if (!SD.exists(filename)) {
                            sstatus = shortname + " does not exist!";
                        } else {
                            if (SD.remove(filename)) {
                                sstatus = shortname + " deleted";
                            } else {
                                sstatus = "Cannot deleted ";
                                sstatus += shortname;
                            }
                        }   
                    }
                } else if (strcmp(command_str, "deletedir") == 0) {
                    if (httpd_query_key_value(parametr, "filename", command_str, sizeof(command_str)) == ESP_OK) {
                        String filename;
                        String shortname = command_str;
                        shortname.replace("/", "");
                        filename = String(path) + "/" + shortname;
                        filename.replace("//", "/");
                        if (filename != "/") {
                            if (!SD.exists(filename)) {
                                sstatus = shortname + " does not exist!";
                            } else {
                                Error err = delete_files(filename.c_str());
                                if (err != Error::Ok) {
                                    sstatus = "Error deleting: ";
                                    sstatus += shortname;
                                } else {
                                    sstatus = shortname;
                                    sstatus += " deleted";
                                }
                            }
                        } else {
                            sstatus = "Cannot delete root";
                        }
                    }
                } else if (strcmp(command_str, "createdir") == 0) {
                    if (httpd_query_key_value(parametr, "filename", command_str, sizeof(command_str)) == ESP_OK) {
                        String filename;
                        String shortname = command_str;
                        filename         = path + shortname;
                        shortname.replace("/", "");
                        filename.replace("//", "/");
                        if (SD.exists(filename)) {
                            sstatus = shortname + " already exists!";
                        } else {
                            if (!SD.mkdir(filename)) {
                            sstatus = "Cannot create ";
                            sstatus += shortname;
                            } else {
                                sstatus = shortname + " created";
                            }
                        }
                    }
                }
            }
            if(httpd_query_key_value(parametr, "dontlist", command_str, sizeof(command_str)) == ESP_OK && strcmp(command_str, "yes")) {
                    list_files = false;
            }  
        }

        // TODO Settings - consider using the JSONEncoder class
        String jsonfile = "{";
        jsonfile += "\"files\":[";

        if (strcmp(path, "/") != 0) {
            size_t len = strlen(path);
            if (path[len - 1] == '/') {
                path[len - 1] = '\0';
            }
        }
        if(strcmp(path, "/") != 0 && !SD.exists(path)) {
            String s = "{\"status\":\" ";
            s += path;
            s += " does not exist on SD Card\"}";
            httpd_resp_set_hdr(req, "Cache-Control", HTTPD_TYPE_JSON);
            httpd_resp_send(req, s.c_str(), s.length());
           // _webserver->send(200, "application/json", s);
           // SD.end();
            set_sd_state(SDState::Idle);
            return ESP_OK;
        }
        String file_path ="/sd";
        if (list_files) {
            DIR *dir = opendir("/sd");
            if (dir) {
                //ESP_LOGI("SD", "Directory opened successfully");
                int i = 0;
                struct dirent *entry;
                while ((entry = readdir(dir)) != NULL) {
                    WebUI::COMMANDS::wait(1);
                    struct stat entry_stat;
                    if (i > 0) {
                        jsonfile += ",";
                    }
                    if (strcmp(entry->d_name, ".") == 0 || strcmp(entry->d_name, "..") == 0) {
                        continue;
                    }
                    char entryPath[512];
                    snprintf(entryPath, sizeof(entryPath), "%s/%s", file_path.c_str(), entry->d_name);
                    if (stat(entryPath, &entry_stat) == -1) {
                        ESP_LOGE(TAG, "Failed to get stat for %s", file_path.c_str());
                        continue;
                    }
                    jsonfile += "{\"name\":\"";
                    String tmpname = entry->d_name;
                    int    pos     = tmpname.lastIndexOf("/");
                    tmpname        = tmpname.substring(pos + 1);
                    jsonfile += tmpname;
                    jsonfile += "\",\"shortname\":\"";  //No need here
                    jsonfile += tmpname;
                    jsonfile += "\",\"size\":\"";
                    jsonfile += S_ISDIR(entry_stat.st_mode)? "-1": WebUI::ESPResponseStream::formatBytes(entry_stat.st_size);
                    jsonfile += "\",\"datetime\":\"";
                    //TODO - can be done later
                    jsonfile += "\"}";
                    i++;
                }
                closedir(dir);
            }
        }
        jsonfile += "],\"path\":\"";
        jsonfile +=String(path) + "\",";
        jsonfile += "\"total\":\"";
        String stotalspace, susedspace;
        //SDCard are in GB or MB but no less
        totalspace  = SD.totalBytes();
        usedspace   = SD.usedBytes();
        stotalspace = WebUI::ESPResponseStream::formatBytes(totalspace);
        susedspace  = WebUI::ESPResponseStream::formatBytes(usedspace + 1);

