aaronderek0401-ops/ink-coop/components/grbl_esp32s3/Grbl_Esp32/src/WebUI/WebServer.cpp
        uint32_t occupedspace = 1;
        uint32_t usedspace2   = usedspace / (1024 * 1024);
        uint32_t totalspace2  = totalspace / (1024 * 1024);
        occupedspace          = (usedspace2 * 100) / totalspace2;
        //minimum if even one byte is used is 1%
        if (occupedspace <= 1) {
            occupedspace = 1;
        }
        if (totalspace) {
            jsonfile += stotalspace;
        } else {
            jsonfile += "-1";
        }
        jsonfile += "\",\"used\":\"";
        jsonfile += susedspace;
        jsonfile += "\",\"occupation\":\"";
        if (totalspace) {
            jsonfile += String(occupedspace);
        } else {
            jsonfile += "-1";
        }
        jsonfile += "\",";
        jsonfile += "\"mode\":\"direct\",";
        jsonfile += "\"status\":\"";
        jsonfile += sstatus + "\"";
        jsonfile += "}";
        httpd_resp_set_hdr(req, "Cache-Control", "no-cache");
        //  Uart0.printf("JSON Output: %s\r\n", jsonfile.c_str());
        //ESP_LOGI(TAG, "JSON Output: %s", jsonfile.c_str());
        httpd_resp_set_hdr(req, "Content-Type", HTTPD_TYPE_JSON);
        httpd_resp_send(req, jsonfile.c_str(), jsonfile.length());
        set_sd_state(SDState::Idle);
        return ESP_OK;
    }
    
    static esp_err_t Web_layout_upload_handler(httpd_req_t *req) {
        #define LAYOUT_UPLOAD_BUFFER_SIZE 8192
        
        if (req->method == HTTP_POST) {
            char* buf = (char*)heap_caps_malloc(LAYOUT_UPLOAD_BUFFER_SIZE, MALLOC_CAP_INTERNAL);
            if (!buf) {
                ESP_LOGE(TAG, "Failed to allocate memory for layout upload!");
                httpd_resp_send_500(req);
                return ESP_ERR_NO_MEM;
            }

            int received = 0;
            char layout_json[4096] = {0};
            size_t json_length = 0;
            
            // 接收JSON数据
            while ((received = httpd_req_recv(req, buf, LAYOUT_UPLOAD_BUFFER_SIZE)) > 0) {
                if (json_length + received < sizeof(layout_json)) {
                    memcpy(layout_json + json_length, buf, received);
                    json_length += received;
                } else {
                    ESP_LOGE(TAG, "Layout JSON too large!");
                    free(buf);
                    httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Layout JSON too large");
                    return ESP_FAIL;
                }
            }
            free(buf);
            
            if (json_length == 0) {
                ESP_LOGE(TAG, "No layout data received");
                httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "No layout data received");
                return ESP_FAIL;
            }
            
            // 解析布局JSON
            ESP_LOGI(TAG, "Received layout JSON, length: %d", json_length);
            
            // 保存到文件
            if (get_sd_state(true) != SDState::Idle) {
                grbl_send(CLIENT_ALL, "[MSG:Upload cancelled - SD card busy]\r\n");
                httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "SD card busy");
                return ESP_ERR_INVALID_STATE;
            }
            
            set_sd_state(SDState::BusyUploading);
            
            String filename = "/layout.json";
            if (SD.exists(filename)) {
                SD.remove(filename);
            }
            
            File layoutFile = SD.open(filename.c_str(), FILE_WRITE);
            if (!layoutFile) {
                ESP_LOGE(TAG, "Failed to create layout file");
                set_sd_state(SDState::Idle);
                httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Failed to create layout file");
                return ESP_FAIL;
            }
            
            size_t bytesWritten = layoutFile.write((const uint8_t *)layout_json, json_length);
            layoutFile.close();
            
            if (bytesWritten != json_length) {
                ESP_LOGE(TAG, "Failed to write layout file");
                set_sd_state(SDState::Idle);
                httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Failed to write layout file");
                return ESP_FAIL;
            }
            
            ESP_LOGI(TAG, "Layout saved to SD card: %d bytes", bytesWritten);
            set_sd_state(SDState::Idle);
            
            // 解析并应用布局
            if (parseAndApplyLayout(layout_json)) {
                ESP_LOGI(TAG, "Layout applied successfully");
                httpd_resp_sendstr(req, "{\"status\":\"success\",\"message\":\"Layout uploaded and applied successfully\"}");
            } else {
                ESP_LOGE(TAG, "Failed to apply layout");
                httpd_resp_sendstr(req, "{\"status\":\"error\",\"message\":\"Layout uploaded but failed to apply\"}");
            }
            
            return ESP_OK;
            
        }else if (req->method == HTTP_GET) {
            // 使用动态内存分配，避免栈溢出
            char *response = (char*)heap_caps_malloc(8192, MALLOC_CAP_INTERNAL);
            if (!response) {
                ESP_LOGE("HTTP", "内存分配失败");
                httpd_resp_send_500(req);
                return ESP_FAIL;
            }
            
            // 调用 getCurrentLayoutInfo 函数获取布局信息
            bool success = getCurrentLayoutInfo(response, 8192);
            
            if (success) {
                ESP_LOGI("HTTP", "返回JSON数据，长度: %d", strlen(response));
                
                // 设置响应头
                httpd_resp_set_type(req, "application/json");
                httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
                httpd_resp_set_hdr(req, "Access-Control-Allow-Methods", "GET, POST, OPTIONS");
                httpd_resp_set_hdr(req, "Access-Control-Allow-Headers", "Content-Type");
                
                // 发送响应
                esp_err_t ret = httpd_resp_send(req, response, strlen(response));
                free(response);
                return ret;
            } else {
                ESP_LOGE("HTTP", "获取布局信息失败");
                free(response);
                httpd_resp_set_type(req, "application/json");
                httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "获取布局信息失败");
                return ESP_FAIL;
            }
        } else {
            // 处理其他HTTP方法
            ESP_LOGW(TAG, "不支持的HTTP方法: %d", req->method);
            httpd_resp_send_err(req, HTTPD_405_METHOD_NOT_ALLOWED, "Method not allowed");
            return ESP_ERR_INVALID_ARG;
        }
    }

    uint16_t fileNum = 0;
    static esp_err_t handle_getsd_fileAndNum_handler(httpd_req_t *req) {
        #define UPLOAD_FILE_BUFFER_SIZE 2048
        static File   sdUploadFile;
        if (req->method == HTTP_POST) {
            size_t free_heap_size = heap_caps_get_free_size(MALLOC_CAP_8BIT);
           char* buf = (char*)heap_caps_malloc(UPLOAD_FILE_BUFFER_SIZE, MALLOC_CAP_INTERNAL);
            if (!buf) {
                ESP_LOGE(TAG, "Failed to allocate memory of %d bytes!", req->content_len);
                httpd_resp_send_500(req);
                return ESP_ERR_NO_MEM;
            }

            int received=0, remaining = 0;
            size_t write_size = 0;
            String tempFileName;
            if ((received = httpd_req_recv(req, buf, MIN(remaining, UPLOAD_FILE_BUFFER_SIZE))) <= 0) {
                free(buf);
                /* Respond with 500 Internal Server Error */
                httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Failed to receive file");
                return ESP_FAIL;
            }
            UploadFileInfo uploadFileInfo;
            const char *currentPos = buf;
            const char *str = "content-disposition: form-data; name=";
            uint8_t strLen = strlen(str);
            uint64_t start_time = esp_timer_get_time();
            if ((currentPos = strcasestr(currentPos, str)) != NULL) {
                currentPos += strLen;
                char temp[32];
                if (sscanf(currentPos, "\"%[^\"]\"\r\n\r\n%[^\r\n]", temp, uploadFileInfo.path) == 2) {
                    if (strcmp(temp, "path") != 0) {
                        free(buf);
                        ESP_LOGE(TAG, "Invalid Content-Disposition header");
                        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Invalid parameter");
                        return ESP_ERR_INVALID_ARG;
                    }
                } else {
                    free(buf);
                    ESP_LOGE(TAG, "Failed to parse Content-Disposition header");
                    httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Invalid parameter");
                    return ESP_ERR_INVALID_ARG;
                }
            } else {
                free(buf);
                httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Invalid parameter");
                return ESP_ERR_INVALID_ARG;
            }

            if ((currentPos = strcasestr(currentPos, str)) != NULL) {
                currentPos += strLen;
                char temp[32];
                if (sscanf(currentPos, "\"%[^\"]\"\r\n\r\n%u",temp, &uploadFileInfo.totalSize) == 2) {
                    if (strcmp(temp, "size") != 0) {
                        free(buf);
                        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Invalid parameter");
                        return ESP_ERR_INVALID_ARG;
                    }
                } else {
                    free(buf);
                    httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Invalid parameter");
                    return ESP_ERR_INVALID_ARG;
                }
            } else {
                free(buf);
                httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Invalid parameter");
                return ESP_ERR_INVALID_ARG;
            } 
            if ((currentPos = strcasestr(currentPos, str)) != NULL) {
                currentPos += strLen;
                char temp[32];
                if (sscanf(currentPos, "\"%[^\"]\"; filename=\"%[^\"]\"", temp, uploadFileInfo.name) == 2) {
                    if (strcmp(temp, "file") != 0) {
                        free(buf);
                        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Invalid parameter");
                        return ESP_ERR_INVALID_ARG;
                    }
                    if ((currentPos = strcasestr(currentPos, "\r\n\r\n")) != NULL) {
                        currentPos += strlen("\r\n\r\n");
                        if (get_sd_state(true) != SDState::Idle) {
                            grbl_send(CLIENT_ALL, "[MSG:Upload cancelled]\r\n");
                            if (get_sd_state(true) == SDState::NotPresent) {
                                httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "No SD card");
                            } else {
                                httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "SDCard busy");
                            }
                            free(buf);
                            return ESP_ERR_INVALID_ARG;
                        }
                        set_sd_state(SDState::BusyUploading);
                        String filename = uploadFileInfo.name;
                        if (filename[0] != '/') {
                            filename = "/" + filename;
                        }
                        if (SD.exists(filename)) {
                            SD.remove(filename);
                            if (filename.length() > 0 && filename.startsWith("/")) {
                                filename = filename.substring(1);
                            }
                        }
                        String sizeargname =filename + "S";
                        if (uploadFileInfo.totalSize > 0) {
                           remaining = uploadFileInfo.totalSize;
                            uint64_t freespace = SD.totalBytes() - SD.usedBytes();
                            if (uploadFileInfo.totalSize > freespace) {
                                free(buf);
                                grbl_send(CLIENT_ALL, "[MSG:Upload error]\r\n");
                                set_sd_state(SDState::Idle);
                                httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Upload rejected, not enough space");
                                return ESP_ERR_INVALID_ARG;
                            }
                        }
                        //Create file for writing
                         size_t bytesWritten = 0;
                        sdUploadFile = SD.open(filename.c_str(), FILE_WRITE);
                        //check if creation succeed
                        if (!sdUploadFile) {
                            free(buf);
                            sdUploadFile.close();
                            grbl_send(CLIENT_ALL, "[MSG:Upload failed]\r\n");
                            set_sd_state(SDState::Idle);
                            httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "File creation failed");
                            return ESP_ERR_NO_MEM;
                        } else {
                            if (received - (currentPos - buf) > remaining) {
                                write_size = remaining;
                            } else {
                                write_size = received - (currentPos - buf);
                            }
                           bytesWritten=sdUploadFile.write((const uint8_t *)currentPos, write_size); 
                            if (write_size != bytesWritten) {
                                free(buf);
                                grbl_send(CLIENT_ALL, "[MSG:Upload error]\r\n");
                                sdUploadFile.close();
                                set_sd_state(SDState::Idle);
                                httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Upload error");
                            }
                            remaining -= bytesWritten;
                        }  
                    }
                } else {
                    free(buf);
                    httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Invalid parameter");
                    set_sd_state(SDState::Idle);
                    return ESP_ERR_INVALID_ARG;
                }
            } else {
                free(buf);
                httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Invalid parameter");
                set_sd_state(SDState::Idle);
                 return ESP_ERR_INVALID_ARG;
            }

