aaronderek0401-ops/ink-coop/components/grbl_esp32s3/Grbl_Esp32/src/WebUI/WebServer.cpp
            uint32_t occupedspace = 1;
          //  uint32_t usedspace2   = usedspace / (1024 * 1024);
          //  uint32_t totalspace2  = totalspace / (1024 * 1024);
          //  occupedspace          = (usedspace2 * 100) / totalspace2;
           occupedspace = (usedspace * 100) / totalspace;
            //minimum if even one byte is used is 1%
            if (occupedspace <= 1) {
                occupedspace = 1;
            }
            if (totalspace) {
                jsonfile += totalspace;
            } else {
                jsonfile += "-1";
            }
            jsonfile += "\",\"used\":\"";
            jsonfile += usedspace;
            jsonfile += "\",\"occupation\":\"";
            if (totalspace) {
                jsonfile += String(occupedspace);
            } else {
                jsonfile += "-1";
            }
            jsonfile += "\",";
            jsonfile += "\"mode\":\"direct\",";
            jsonfile += "\"status\":\"";
            jsonfile += sstatus + "\"";
            jsonfile += "}";
            httpd_resp_set_hdr(req, "Cache-Control", "no-cache");
            httpd_resp_set_hdr(req, "Content-Type", HTTPD_TYPE_JSON);
            httpd_resp_send(req, jsonfile.c_str(), jsonfile.length());
            set_sd_state(SDState::Idle);
        }
        return ESP_OK;
    }
    static const httpd_uri_t basic_handlers[] = {
        { .uri      = "/",
        .method   = HTTP_GET,
        .handler  = root_handler,
        .user_ctx = NULL,
        },
        { .uri      = "/favicon.ico",
        .method   = HTTP_GET,
        .handler  = icon_handler,
        .user_ctx = NULL,
        },
        { .uri      = "/upload",
        .method   = HTTP_POST,
        .handler  = SDFile_direct_upload_handler,
        .user_ctx = NULL,
        },
        { .uri      = "/files",
        .method   = HTTP_GET,
        .handler  = SDFile_direct_upload_handler,
        .user_ctx = NULL,
        },
        { .uri      = "/getsd",
        .method   = HTTP_GET,
        .handler  = handle_getsd_fileAndNum_handler,
        .user_ctx = NULL,
        },
        { .uri      = "/command",
        .method   = HTTP_GET,
        .handler  = web_command_handler,
        .user_ctx = NULL,
        },
        { .uri      = "/updatefw",
        .method   = HTTP_POST,
        .handler  = update_upload_handler,
        .user_ctx = NULL,
        },
        { .uri      = "/getlayout",
        .method   = HTTP_GET,
        .handler  = Web_layout_upload_handler,
        .user_ctx = NULL,
        },
        { .uri      = "/setlayout",
        .method   = HTTP_POST,
        .handler  = Web_layout_upload_handler,
        .user_ctx = NULL,
        },
    };
    static const uint8_t basic_handlers_no = sizeof(basic_handlers)/sizeof(httpd_uri_t);

    static void register_basic_handlers(httpd_handle_t hd)
    {
        //ESP_LOGI(TAG, "Registering basic handlers");
        for (uint8_t i = 0; i < basic_handlers_no; i++) {
            if (httpd_register_uri_handler(hd, &basic_handlers[i]) != ESP_OK) {
                ESP_LOGW(TAG, "register uri failed for %d", i);
                return;
            }
        }
    }
    static httpd_handle_t start_webserver(void)
    {
        httpd_handle_t server = NULL;
        httpd_config_t config = HTTPD_DEFAULT_CONFIG();
        config.stack_size = 8192;
        config.max_uri_handlers  = 10;
        config.server_port = 8848;
        // Start the httpd server
        
        if (httpd_start(&server, &config) == ESP_OK) {
            // Registering the ws handler
            register_basic_handlers(server);
            httpd_register_err_handler(server, HTTPD_404_NOT_FOUND, not_found_handle);
            ESP_LOGW(TAG, "Started HTTP server on port: '%d'", config.server_port);
            ESP_LOGW(TAG, "Max URI handlers: '%d'", config.max_uri_handlers);
            ESP_LOGW(TAG, "Max Open Sessions: '%d'", config.max_open_sockets);
            ESP_LOGW(TAG, "Max Header Length: '%d'", HTTPD_MAX_REQ_HDR_LEN);
            ESP_LOGW(TAG, "Max URI Length: '%d'", HTTPD_MAX_URI_LEN);
            ESP_LOGW(TAG, "Max Stack Size: '%d'", config.stack_size);
            return server;
        }

        ESP_LOGE(TAG, "Error starting server!");
        return NULL;
    }
    esp_err_t stop_webserver(httpd_handle_t server)
    {
        if (server) {
            return httpd_stop(server);
        }
        return ESP_OK;
    }
 #    ifdef ENABLE_SSDP
    //http SSDP xml presentation
    static esp_err_t SSDP_handler(httpd_req_t *req) {
    StreamString sschema;
    if (sschema.reserve(1024)) {
        // 使用更安全的字符串构建方式
        String sip = WiFi.localIP().toString();
        uint32_t chipId = (uint16_t)(ESP.getEfuseMac() >> 32);
        
        char uuid[37];
        snprintf(uuid, sizeof(uuid),
                "38323636-4558-4dda-9188-cda0e6%02x%02x%02x",
                (uint16_t)((chipId >> 16) & 0xff),
                (uint16_t)(chipId & 0xff),
                (uint16_t)((chipId >> 8) & 0xff));
        
        String serialNumber = String(chipId);
        String hostname = WebUI::wifi_config.Hostname();
        
        // 构建 XML 响应 - 使用 StreamString 的 print 方法
        sschema.print("<?xml version=\"1.0\"?>");
        sschema.print("<root xmlns=\"urn:schemas-upnp-org:device-1-0\">");
        sschema.print("<specVersion>");
        sschema.print("<major>1</major>");
        sschema.print("<minor>0</minor>");
        sschema.print("</specVersion>");
        sschema.print("<URLBase>http://");
        sschema.print(sip.c_str());
        sschema.print(":");
        sschema.print(WebUI::http_port->get());
        sschema.print("/</URLBase>");
        sschema.print("<device>");
        sschema.print("<deviceType>urn:device:BLGS</deviceType>");
        sschema.print("<Machine>");
        sschema.print(MACHINE_TYPE);
        sschema.print("</Machine>");
        sschema.print("<software>");
        sschema.print(VERSION);
        sschema.print("</software>");
        sschema.print("<Wavelength>");
        sschema.print(WAVELENGTH);
        sschema.print("</Wavelength>");
        sschema.print("<Power>");
        sschema.print(POWER);
        sschema.print("</Power>");
        
        // 工作空间
        char workspace[64];
        snprintf(workspace, sizeof(workspace), "XSIZE=%.2f,YSIZE=%.2f", 
                 DEFAULT_X_MAX_TRAVEL, DEFAULT_Y_MAX_TRAVEL);
        sschema.print("<WorkSpace>");
        sschema.print(workspace);
        sschema.print("</WorkSpace>");
        
        sschema.print("<friendlyName>");
        sschema.print(hostname.c_str());
        sschema.print("</friendlyName>");
        sschema.print("<presentationURL>/</presentationURL>");
        sschema.print("<serialNumber>");
        sschema.print(serialNumber.c_str());
        sschema.print("</serialNumber>");
        sschema.print("<modelName>ESP32</modelName>");
        sschema.print("<modelNumber>Marlin</modelNumber>");
        sschema.print("<modelURL>http://espressif.com/en/products/hardware/esp-wroom-32/overview</modelURL>");
        sschema.print("<manufacturer>Espressif Systems</manufacturer>");
        sschema.print("<manufacturerURL>http://espressif.com</manufacturerURL>");
        sschema.print("<UDN>uuid:");
        sschema.print(uuid);
        sschema.print("</UDN>");
        sschema.print("</device>");
        sschema.print("</root>\r\n\r\n");
        
        httpd_resp_set_hdr(req, "Content-Type", "text/xml");
        httpd_resp_send(req, sschema.c_str(), HTTPD_RESP_USE_STRLEN);
    } else {
        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "No memory");
    }
    return ESP_OK;
}
#    endif
    namespace WebUI {
        static const char *TAG = "WebServer";

