aaronderek0401-ops/ink-coop/components/grbl_esp32s3/Grbl_Esp32/src/WebUI/WebServer.cpp
        Web_Server        web_server;
        bool              Web_Server::_setupdone     = false;
        uint16_t          Web_Server::_port          = 0;
        long              Web_Server::_id_connection = 0;
        httpd_handle_t    Web_Server::_webserver     = NULL;
        WebSocketsServer* Web_Server::_socket_server = NULL;
        SSDPClass*        Web_Server::_ssdp_server   = NULL;

        Web_Server::Web_Server() {}
        Web_Server::~Web_Server() { end(); }

        long Web_Server::get_client_ID() { return _id_connection; }

        bool Web_Server::begin() {
            bool no_error = true;
            if (http_enable->get() == 0 || _setupdone) {
                ESP_LOGW(TAG, "WebServer already started or disabled");
                return false;
            }

            _port = http_port->get();
            _webserver = start_webserver();

            _socket_server = new WebSocketsServer(_port + 1);
            _socket_server->begin();
            _socket_server->onEvent(handle_Websocket_Event);

            //Websocket output
            Serial2Socket.attachWS(_socket_server);

    #    ifdef ENABLE_SSDP
            //SSDP service presentation
            if (WiFi.getMode() == WIFI_STA) {
                httpd_uri_t ssdp_handler = {
                    .uri      = "/description.xml",
                    .method   = HTTP_GET,
                    .handler  = SSDP_handler,
                    .user_ctx = NULL
                };
                httpd_register_uri_handler(_webserver, &ssdp_handler);
                //Add specific for SSDP
                _ssdp_server =  new SSDPClass();
                _ssdp_server->setSchemaURL("description.xml");
                _ssdp_server->setHTTPPort(_port);
                _ssdp_server->setName(wifi_config.Hostname());
                _ssdp_server->setURL("/");
                _ssdp_server->setDeviceType("urn:device:LOKLIK LEF01");
                //Start SSDP
    #        ifdef DEBUG_INIT
                grbl_send(CLIENT_ALL, "[MSG:SSDP Started]\r\n");
    #        endif
                grbl_send(CLIENT_ALL, "[MSG:SSDP Started]\r\n");
                _ssdp_server->begin();
            }
    #    endif
            _setupdone = true;
            return no_error;
        }

        void Web_Server::end() {
            _setupdone = false;
    #    ifdef ENABLE_SSDP
            if (_ssdp_server) {
                httpd_unregister_uri_handler(_webserver, "/description.xml", HTTP_GET);
                delete _ssdp_server;
                _ssdp_server = NULL;
            }
    #    endif  //ENABLE_SSDP

            ESP_LOGE(TAG, "stop webserver");
            if (_webserver) {
                stop_webserver(_webserver);
                _webserver = NULL;
            }

            Serial2Socket.detachWS();
            if (_socket_server) {
                delete _socket_server;
                _socket_server = NULL;
            }
    }

    void Web_Server::handle() {
        static uint32_t timeout = millis();
        COMMANDS::wait(0);
        if (_socket_server && _setupdone) {
            _socket_server->loop();
        }
        if ((millis() - timeout) > 10000 && _socket_server) {
            String s = "PING:";
            s += String(_id_connection);
            _socket_server->broadcastTXT(s);
            timeout = millis();
        }
    }
   
    void Web_Server::handle_Websocket_Event(uint8_t num, uint8_t type, uint8_t* payload, size_t length) {
        switch (type) {
            case WStype_DISCONNECTED:
                Uart0.printf("[%u] Disconnected!\n", num);
                break;
            case WStype_CONNECTED: {
                IPAddress ip = _socket_server->remoteIP(num);
                Uart0.printf("[%u] Connected from %d.%d.%d.%d url: %s\n", num, ip[0], ip[1], ip[2], ip[3], payload);
                String s = "CURRENT_ID:" + String(num);
                // send message to client
                _id_connection = num;
                _socket_server->sendTXT(_id_connection, s);
                s = "ACTIVE_ID:" + String(_id_connection);
                _socket_server->broadcastTXT(s);
            } break;
            case WStype_TEXT:
                Uart0.printf("[%u] get Text: %s\n", num, payload);

                // send message to client
                // webSocket.sendTXT(num, "message here");

                // send data to all connected clients
                // webSocket.broadcastTXT("message here");
                break;
            case WStype_BIN:
                Uart0.printf("[%u] get binary length: %u\n", num, length);
                //hexdump(payload, length);

                // send message to client
                // webSocket.sendBIN(num, payload, length);
                break;
            default:
                break;
        }
    }
}
#endif  // Enable HTTP && ENABLE_WIFI

